tap "acorn-io/cli"
tap "authzed/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jzelinskie/faq"
tap "koekeishiya/formulae"
tap "njhale/tap"
tap "txn2/tap"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "python@3.11"
brew "asciinema"
brew "bash"
brew "freetype"
brew "glib"
brew "harfbuzz"
brew "openjdk@11"
brew "bazel"
brew "openssl@3"
brew "binutils"
brew "coreutils"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "gcc"
brew "suite-sparse"
brew "tbb"
brew "ceres-solver"
brew "cilium-cli"
brew "libslirp"
brew "libssh"
brew "qemu"
brew "lima"
brew "colima"
brew "crane"
brew "ctags"
brew "delve"
brew "dfu-util"
brew "direnv"
brew "docker"
brew "docker-machine"
brew "envoy"
brew "etcd"
brew "fd"
brew "fish"
brew "fzf"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghz"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "golangci-lint"
brew "gpgme"
brew "netpbm"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grpcurl"
brew "guile"
brew "hdf5"
brew "htop"
brew "hubble"
brew "hunspell"
brew "jq"
brew "k3d"
brew "k9s"
brew "kind", args: ["HEAD"]
brew "krb5"
brew "kubernetes-cli"
brew "lazygit"
brew "libpq"
brew "libproxy"
brew "libssh2"
brew "mercurial"
brew "minikube"
brew "neofetch"
brew "neovim"
brew "netcdf"
brew "nghttp2"
brew "node"
brew "numpy"
brew "perl"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "pure"
brew "pv"
brew "qt"
brew "pyqt"
brew "python@3.10"
brew "tcl-tk"
brew "python@3.8"
brew "python@3.9"
brew "qt@5"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "sip"
brew "slides"
brew "socat"
brew "sox"
brew "starship"
brew "tree"
brew "vcluster"
brew "vim"
brew "watch"
brew "wget"
brew "wimlib"
brew "yarn"
brew "yq"
brew "zsh"
brew "acorn-io/cli/acorn"
brew "authzed/tap/zed", args: ["HEAD"]
brew "jzelinskie/faq/faq"
brew "njhale/tap/grpctl", args: ["HEAD"]
brew "txn2/tap/kubefwd"
cask "1password"
cask "1password-cli"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "gather"
cask "github"
cask "google-chrome"
cask "hammerspoon"
cask "kitty"
cask "microsoft-auto-update"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "notion"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
cask "zoom"
vscode "Acorn-Labs.acorn"
vscode "Avetis.tokyo-night"
vscode "eamodio.gitlens"
vscode "GitHub.copilot"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode.makefile-tools"
vscode "tamasfe.even-better-toml"
