tap "acorn-io/cli"
tap "authzed/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jzelinskie/faq"
tap "koekeishiya/formulae"
tap "njhale/tap"
tap "txn2/tap"
brew "python@3.10"
brew "asciinema"
brew "bash"
brew "glib"
brew "harfbuzz"
brew "bazel"
brew "binutils"
brew "coreutils"
brew "unbound"
brew "gnutls"
brew "guile"
brew "emacs"
brew "cask"
brew "gcc"
brew "suite-sparse"
brew "tbb"
brew "ceres-solver"
brew "libslirp"
brew "qemu"
brew "lima"
brew "colima"
brew "ctags"
brew "dfu-util"
brew "direnv"
brew "docker"
brew "docker-machine"
brew "envoy"
brew "etcd"
brew "fd"
brew "gdk-pixbuf"
brew "gh"
brew "ghz"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gpgme"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grpcurl"
brew "hdf5"
brew "htop"
brew "hunspell"
brew "jq"
brew "k3d"
brew "k9s"
brew "kind", args: ["HEAD"]
brew "krb5"
brew "kubernetes-cli"
brew "lazygit"
brew "libpq"
brew "libproxy"
brew "libssh2"
brew "mercurial"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "netcdf"
brew "nghttp2"
brew "node"
brew "numpy"
brew "openssl@3"
brew "perl"
brew "pgformatter"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "pure"
brew "pv"
brew "qt"
brew "pyqt"
brew "qt@5"
brew "pyqt@5"
brew "tcl-tk"
brew "python@3.8"
brew "python@3.9"
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "sip"
brew "slides"
brew "socat"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "wimlib"
brew "zsh"
brew "acorn-io/cli/acorn"
brew "authzed/tap/zed", args: ["HEAD"]
brew "jzelinskie/faq/faq"
brew "njhale/tap/grpctl", args: ["HEAD"]
brew "txn2/tap/kubefwd"
cask "1password"
cask "1password-cli"
cask "discord"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "iterm2"
cask "keybase"
cask "kitty"
cask "obsidian"
cask "rectangle"
cask "signal"
cask "slack"
cask "visual-studio-code"
cask "zoom"
